class Solution {
    public int solution(int a, int b, int n) {
        int answer = 0;
        // 콜라 빈 병 2개 콜라 새거 1개
        // 20개 주면 10개 받고 10개 주면 5개 받고 10 + 5
        // 5병 주면 2개 받고(몫) 나머지 1(빈병) + 2
        // (빈병 3개) 2개 주면 1개 받고 빈병 1개 남음 + 1
        // (빈병 2개) 주면 또 1개 받음 + 1
        // 총 10 + 5 + 2 + 1 + 1 = 19
        // 빈병 a(2개) 개 가져다 주면 콜라 b(1개)개 준다면
        // 빈병이 총 n개(20병)일 때 받을 수 있는 수는?
        while(n >= a) {
            // 20개 가 2보다 클 때 n이 2일때까지 계속 돌아야함
            answer += (n / a) * b; // 20 / 2 * 1 (돌려주는 개수 b 곱해줘야함)
            n = (n / a) * b + (n % a) ; // 20 을 22로 나눠서 10 돌려받은 1 곱해주면 10 그리고 나머지가 남을 때도 있으로 n % a를 더해줌
        }
        return answer;
    }
}